Revit 2018 API
StructuralSectionCSlopedFlange Constructor
Overload List
Name | Description
StructuralSectionCSlopedFlange(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) |  Obsolete.
 Creates a new instance of Structural Section C Sloped Flange shape with the associated set of parameters, used to attach to structural element.
StructuralSectionCSlopedFlange(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Creates a new instance of Structural Section C Sloped Flange shape with the associated set of parameters, used to attach to structural element.
See Also
StructuralSectionCSlopedFlange Class
StructuralSectionCSlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace